app/controllers/sessions_controller.rb

  def create
    @auth = request.env["omniauth.auth"]
    @user = User.find_by_provider_and_uid(@auth["provider"], @auth["uid"]) || User.create_with_omniauth(@auth)
    @current_user=User.find(@user.id)
---
INSERT INTO `users` (`provider`, `uid`, `name`, `username`, `auth_token`, `auth_token_secret`, `created_at`, `updated_at`) VALUES ('twitter', '2821501915', 'indrajeet ambadekar', 'IAmbadekar', '2821501915-y6PXw2bNdpBxzo4MIEFJ5bky36bSAMsVcqGimoe', 'wjNX5CqZ0h9w3pRgms2NPHGxP3C7IVq6Tg2Thfky7z4Ur', '2015-02-22 11:55:53.338790', '2015-02-22 11:55:53.338790')
SELECT  `users`.* FROM `users` WHERE `users`.`provider` = 'twitter' AND `users`.`uid` = '2821501915' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1